{
    "language": "es",
    "dark_mode": "Modo oscuro",

    "home_welcome": "Hola, Yo soy David Huaricancha.",
    "home_what_i_do": "Construyó cosas asombrosas para la web.",
    "home_my_jobs": "Soy un Ingeniero de Software.,Soy un Desarrollador Web.,Soy un Desarrollador React.,Soy un Desarrollador Frontend.,Soy un Contribuidor de Open Source.,Soy un Entusiasta de la Tecnología.",
    "home_btn_contact": "Contactame",

    "menu_about": "Sobre mi",
    "menu_projects": "Proyectos",
    "menu_experience": "Experiencia",
    "menu_contact": "Contacto",
    "menu_resume": "Curriculum",

    "about_desc_1": "Front End Developer con background como Ingeniero Informático. 👨‍💻 Experiencia trabajando en React, Redux, Material UI, Node.js, PostgreSQL entre otras tecnologías del sector. Forme parte de un equipo para la creación de un E-commerce de venta y compra de videojuegos fomentando buenas prácticas de programación y patrones de diseño que permiten un rendimiento óptimo para su posicionamiento en la red. Me caracterizo por la capacidad de resolución de problemas, trabajo en equipo, pensamiento creativo, comunicación y autonomía. 👬",
    "about_desc_2": "Actualmente sigo profundizando mis conocimientos, aprendiendo nuevas tecnologías como TypeScript y Next.js, mejorando mi portafolio y realizando proyectos personales para que tengan un impacto positivo en la sociedad. Soy consiente de la relevancia que tiene el idioma ingles en esta industria, es por eso que sigo mejorando mi nivel. 👷‍♂️🏗",
    "about_desc_3": "En mi tiempo libre, me deleito con los placeres de la vida, como salir a manejar bicicleta, 🚴‍♂️ ir al gimnasio,🏋️‍♂️ o tomar un café. ☕ (Me encanta el café ❣) Disfruto descubriendo los secretos de la vida a través de la lectura 📚 y entiendo que siempre nos encontramos en un desarrollo 🧘‍♂️ y que mejor que aprenderlo de los demás. No revientes la rueda. 🌀",
    "about_desc_4": "No dude en enviarme un mensaje si desea saber más acerca de mí. Siempre estoy ansioso por saber de los demás y expandir mi red en LinkedIn. ¿Te gusta el café, la lectura, viajar o bailar? Charlemos un rato de eso. 👇",

    "experience_0_job": "Front End Developer [Academic]",
    "experience_0_overview": "Bootcamp de 6 meses de duración, enfocado en el desarrollo de aplicaciones web con React, Redux, Node.js, Express, PostgreSQL, entre otras tecnologías. Realice proyectos personales y colaborativos para mejorar mis habilidades y conocimientos. 🚀  Trabaje con la metodología SCRUM, utilizando herramientas como Trello y Slack para la comunicación y organización del equipo. 📝",
    "experience_0_duration": "Octubre 2022 - Noviembre 2022",

    "experience_1_job": "Asistente de computación",
    "experience_1_overview": "Asesoría y apoyo con el uso correcto de los activos TI al personal administrativo. Mantener y actualizar la información publicada en la página web de la entidad.Administrar el uso correcto de la infraestructura de red de la entidad.",
    "experience_1_duration": "Julio 2021 - Diciembre 2021",

    "experience_2_job": "Becario de ingeniería de software",
    "experience_2_overview": "Desarrollar sistemas y herramientas con énfasis en el rendimiento y la escalabilidad, mantener bases de datos, documentos funcionales y técnicos.Incremente el rendimiento de las aplicaciones en un 35% a través del correcto uso de los patrones de diseño y buenas prácticas de manejo de datos.Desarrolle un sistema de información para la gestión administrativa y logística de empresas comerciales.",
    "experience_2_duration": "Febrero 2019 - Mayo 2019",

    "projects_1_overview": "Aplicación Web para la gestion de resetas de cocina.",
    "projects_1_extended_overview": "Proyecto individual desarrollado dentro de Henry Bootcamp Desarrollo de una SPA (Single Page Application) utilizando React para el Front End y Redux como state management. Todos los componentes fueron desarrollados con CSS sin uso de librerías externas. La SPA consume datos de una API (“Spoonacular API”) a través de un Back End desarrollado en Node.JS utilizando Express, agregando nuevas funcionalidades a la API original como el uso del ORM Sequelize para poder conectarse a una base de datos PostgresSQL y porder almacenar los datos creados por el usuario.",

    "projects_2_overview": "GameScript es una plataforma de venta y compra de videojuegos.",
    "projects_2_extended_overview": "Proyecto Grupal desarrollado dentro de Henry Bootcamp Desarrollo de un E-COMMERCE, para la venta y compra de Videojuego utilizando React para el Front End y Redux Toolkit como state management. Todos los componentes fueron estilizados con el Framework Material UI. La App consume datos a través de un Back End desarrollado en Node.JS utilizando Express, y para la conexión a la base de datos se utilizó el ORM Sequelize con el motor de base de datos PostgresSQL. Mi aporte principal al proyecto fue la parte del Front End, aplicando buenas practicas de Front End, estilizando componentes con Material UI, reutilizando componentes y aplicando Stripe para el metodo de pago.",

    "projects_3_overview": "Portfolio personal. Una pagina web para mostrar mis proyectos.",
    "projects_3_extended_overview": "Proyecto individual desarrollador con React, Material UI y CSS. El objetivo de este proyecto es mostrar mis proyectos y habilidades como desarrollador Front End. La pagina consume datos de un archivo JSON para mostrar los proyectos y sus detalles. La pagina esta optimizada para dispositivos moviles y desktop.",

    "contact_full_name": "Nombre Completo",
    "contact_email": "Correo Electrónico",
    "contact_message": "Mensaje",
    "contact_btn": "Enviar Mensaje"
}
